class CollegeData {
  static const String name = "كلية الطب والعلوم الصحية العسكرية";
  static const String vision = "الريادة الإقليمية في تأهيل الكوادر الطبية العسكرية الملتزمة بالثقافة القرآنية والمهنية السريرية التكتيكية العالية.";
  static const String mission = "إعداد أطباء ومساعدين سريريين وقادة طوارئ عسكريين يجمعون بين المعيار الأكاديمي الطبي العالمي والجاهزية الإنقاذية في الخطوط الأمامية للدفاع.";
  
  static const List<Map<String, String>> objectives = [
    {
      "title": "التأصيل الإيماني",
      "desc": "ترسيخ الهوية الإيمانية والثقافة القرآنية لدى جميع المنتسبين كمنطلق للخدمة الإنسانية والجهادية."
    },
    {
      "title": "التكامل السريري التكتيكي",
      "desc": "الجمع الفريد بين مناهج الطب البشري العالمية وبروتوكولات الجراحة الميدانية وإصابات القصف."
    },
    {
      "title": "إدارة الأزمات الميدانية",
      "desc": "تأهيل الخريجين لقيادة خلايا الفرز والإنعاش التكتيكي تحت أقسى ظروف الحصار والعمل الميداني."
    }
  ];
}
